uhnp/src/DataProcessors/НастройкаПравилЗаполненияОбъектовБД/НастройкаПравилЗаполненияОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НастройкаПравилЗаполненияОбъектовБД</name>
  <attributes>
    <name>ОбластьГенерации</name>
    <type>
      <types>EnumRef.ОбластиГенерацииОбъектов</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

uhnp/src/Enums/СпособыФормированияДокументовПоПравилам/СпособыФормированияДокументовПоПравилам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыФормированияДокументовПоПравилам</name>
  <enumValues>
    <name>Автоматически</name>
  </enumValues>
  <enumValues>
    <name>РегламентнымЗаданием</name>
  </enumValues>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ТипыБазДанных/ТипыБазДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыБазДанных</name>
  <predefined>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
    <items>
      <name>ОбменТаблДок</name>
      <description>Файлы Microsoft Excel</description>
    </items>
  </predefined>
  <attributes>
    <name>ВИБПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>EnumRef.ПлатформыВнешнихИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоУмолчанию</name>
    <comment>Если при сопоставлении получено пустое значение валюты, тогда подставить значение валюты по умолчанию</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменДаннымиРегламентнымЗаданием</name>
    <comment>Выполнять данными контроля НСИ регламентным заданием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьНСИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяПланыОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеВидовСубконто</name>
    <attributes>
      <name>ВидСубконтоИБ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ПравилаЗаполненияОбъектовБД/ПравилаЗаполненияОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаЗаполненияОбъектовБД</name>
  <owners>Catalog.ДокументыБД</owners>
  <owners>Catalog.СправочникиБД</owners>
  <attributes>
    <name>ТипБД</name>
    <type>
      <types>CatalogRef.ТипыБазДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДляЗаполненияШапки</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйОбъектБД</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрБухгалтерииПоУмолчанию</name>
    <type>
      <types>CatalogRef.РегистрыБухгалтерииБД</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсРегистраПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоОбъектуБД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовПоУмолчанию</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцедураЗаполнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКодПослеЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсточникиДляЗаполненияТЧ</name>
    <attributes>
      <name>ТабличнаяЧасть</name>
      <type>
        <types>CatalogRef.ТабличныеЧастиБД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникДанных</name>
      <type>
        <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеквизитыШапкиДляСинхронизацииТЧ</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАналитики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеРеквизитыКонтекстаЗагрузки</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСоответствияРеквизитов</name>
    <attributes>
      <name>РасположениеРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаСоответствия</name>
      <type>
        <types>CatalogRef.СоответствиеВнешнимИБ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ВнешниеИнформационныеБазы/ВнешниеИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеИнформационныеБазы</name>
  <predefined>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
  </predefined>
  <attributes>
    <name>URIПространстваИмен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияWindows</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииСФайлами</name>
    <type>
      <types>EnumRef.ВидыОперацийСФайлами</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяWebСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИБНаСервере</name>
    <comment>Имя информационной базы на сервере</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервера</name>
    <comment>Имя сервера 1С: Предприятия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьWS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаПолногоИмени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИмени</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НСИ_ТребуетСинхронизации</name>
    <comment>(НСИ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольНаСтраницу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКWebСервису</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмещениеВнешнейИБ</name>
    <type>
      <types>EnumRef.ВидыРазмещенияИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныйСпособИмпорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБД</name>
    <type>
      <types>CatalogRef.ТипыБазДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТабличногоДокумента</name>
    <type>
      <types>EnumRef.ТипыВнешнихТабличныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПодключенияWebСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьФайлыПослеИмпорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайловыйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьЭлементыНСИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХранилищаДанныхADO</name>
    <type>
      <types>EnumRef.ТипыХранилищДанныхADO</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляИмпортаЭталонныйКаталог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭталонныйКаталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонвертироватьЗначенияВТекст</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЦентрализованнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GUIDЦентрализованнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелИнформационнойБазы</name>
    <type>
      <types>ExchangePlanRef.СинхронизацияДанныхЧерезУниверсальныйФормат</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИнформационнойСистемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураИмени</name>
    <attributes>
      <name>НачалоЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>EnumRef.ТипыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/НастройкаПравилЗаполненияОбъектовБД/Forms/ФормаНастройки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектБД=Параметры.ОбъектБД;
	Организация=Параметры.Организация;
	
	Для Каждого СтрНастройка ИЗ Параметры.МассивНастроек Цикл
		
		НоваяСтрока=ТаблицаПравилЗаполнения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрНастройка);
		
	КонецЦикла;
	
	ТекстЗаголовок=СтрШаблон(Нстр("ru = '%1'"), ОбъектБД);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ТекстЗаголовок=СтрШаблон(Нстр("ru = '%1, организация: %2'"), ТекстЗаголовок, Организация);
		
	Иначе
		
		ТекстЗаголовок=СтрШаблон(Нстр("ru = '%1, по всем организациям'"), ТекстЗаголовок);
		
	КонецЕсли;
	
	Если НЕ ОбъектБД.Владелец=Справочники.ТипыБазДанных.ТекущаяИБ Тогда
		
		ТекстЗаголовок=ТекстЗаголовок+", "+ОбъектБД.Владелец;
		
		Элементы.ТаблицаПравилНастройкиИспользуемаяИБ.Заголовок=Нстр("ru = 'Информационная база (приемник)'");
		
		ВнешняяИБ=Истина;
		
	Иначе
		
		Элементы.ТаблицаПравилНастройкиИспользуемаяИБ.Заголовок=Нстр("ru = 'Информационная база (источник)'");
			
	КонецЕсли;
		
	Заголовок=ТекстЗаголовок;
	
	ТекСписокВыбора = Элементы.ТаблицаПравилНастройкиСпособФормирования.СписокВыбора;
	ТекСписокВыбора.Очистить(); 
	
	СписокСпособов=ЗаполнитьСписокСпособовФормирования();
	
	Для Каждого Элемент ИЗ СписокСпособов Цикл
		
		ТекСписокВыбора.Добавить(Элемент.Значение);
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокСпособовФормирования(ИдентификаторСтроки=Неопределено)
	
	СписокСпособов=Новый СписокЗначений;
	
	Если ИдентификаторСтроки=Неопределено Тогда 
		
		СписокСпособов.Добавить(Перечисления.СпособыФормированияДокументовПоПравилам.Автоматически);
		
	Иначе
		
		СтрокаНастройки=ТаблицаПравилЗаполнения.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Если (ВнешняяИБ ИЛИ СтрокаНастройки.ТипБД=Справочники.ТипыБазДанных.ТекущаяИБ) И ЗначениеЗаполнено(СтрокаНастройки.ИсходныйОбъектБД) Тогда
			
			СписокСпособов.Добавить(Перечисления.СпособыФормированияДокументовПоПравилам.Автоматически);
			
		КонецЕсли;
		
	КонецЕсли;
	
	СписокСпособов.Добавить(Перечисления.СпособыФормированияДокументовПоПравилам.РегламентнымЗаданием);
	СписокСпособов.Добавить(Перечисления.СпособыФормированияДокументовПоПравилам.Вручную); 
	
	Возврат СписокСпособов;
			
КонецФункции // ЗаполнитьСписокСпособовФормирования()

&НаКлиенте
Процедура ТаблицаПравилНастройкиПравилоЗаполненияПриИзменении(Элемент)
	
	ТаблицаПравилНастройкиПравилоЗаполненияПриИзмененииНаСервере(Элементы.ТаблицаПравилНастройки.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаПравилНастройкиПравилоЗаполненияПриИзмененииНаСервере(ИдентификаторСтроки)
	
	ТекущиеДанные=ТаблицаПравилЗаполнения.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ПравилоЗаполнения=ТекущиеДанные.ПравилоЗаполнения;
	
	Если ОбъектБД.Владелец=Справочники.ТипыБазДанных.ТекущаяИБ Тогда
		
		ТекущиеДанные.ТипБД	=ПравилоЗаполнения.ТипБД;
		
		Если ПравилоЗаполнения.ТипБД=Справочники.ТипыБазДанных.ТекущаяИБ Тогда
			
			ТекущиеДанные.ИспользуемаяИБ=Справочники.ТипыБазДанных.ТекущаяИБ;
			
		КонецЕсли;
		
	Иначе
		
		ТекущиеДанные.ТипБД	=ОбъектБД.Владелец;
		
	КонецЕсли;
	
	ТекущиеДанные.ИсходныйОбъектБД=ПравилоЗаполнения.ИсходныйОбъектБД;
		
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	СтруктураПравила=Новый Структура;
	
	Если Модифицированность Тогда
		
		МассивНастроек=Новый Массив;
		
		Для Каждого Строка ИЗ ТаблицаПравилЗаполнения Цикл
			
			СтруктураНастройки=Новый Структура;
			СтруктураНастройки.Вставить("ПравилоЗаполнения",		Строка.ПравилоЗаполнения);
			СтруктураНастройки.Вставить("ИсходныйОбъектБД",			Строка.ИсходныйОбъектБД);
			СтруктураНастройки.Вставить("ИспользуемаяИБ",			Строка.ИспользуемаяИБ);
			СтруктураНастройки.Вставить("СпособФормирования",		Строка.СпособФормирования);
			СтруктураНастройки.Вставить("ПроводитьДокументы",		Строка.ПроводитьДокументы);
			СтруктураНастройки.Вставить("ТипБД",					Строка.ТипБД);
						
			МассивНастроек.Добавить(СтруктураНастройки);
			
		КонецЦикла;
		
		СтруктураПравила.Вставить("Организация",Параметры.Организация);
		СтруктураПравила.Вставить("ОбъектБД",ОбъектБД);
		СтруктураПравила.Вставить("МассивНастроек",МассивНастроек);
		СтруктураПравила.Вставить("Модифицированность",Истина);
		
	Иначе
		
		СтруктураПравила.Вставить("Модифицированность",Ложь);
		
	КонецЕсли;
	
	Оповестить("ИзмененыПравилаЗаполненияОбъектаБД",СтруктураПравила);
	Закрыть();
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОбъектуБДНаСервере()
	
	ТаблицаПравилЗаполнения.Очистить();
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПравилаЗаполненияОбъектовБД.Владелец.Владелец = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ТекущаяИБ)
	|			ТОГДА ПравилаЗаполненияОбъектовБД.ТипБД
	|		ИНАЧЕ ПравилаЗаполненияОбъектовБД.Владелец.Владелец
	|	КОНЕЦ КАК ТипБД,
	|	ПравилаЗаполненияОбъектовБД.ИсходныйОбъектБД,
	|	ПравилаЗаполненияОбъектовБД.Ссылка КАК ПравилоЗаполнения,
	|	ВЫБОР
	|		КОГДА ПравилаЗаполненияОбъектовБД.Владелец.Владелец = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ТекущаяИБ)
	|			ТОГДА ПравилаЗаполненияОбъектовБД.ТипБД.ВИБПоУмолчанию
	|		ИНАЧЕ ПравилаЗаполненияОбъектовБД.Владелец.Владелец.ВИБПоУмолчанию
	|	КОНЕЦ КАК ИспользуемаяИБ
	|ИЗ
	|	Справочник.ПравилаЗаполненияОбъектовБД КАК ПравилаЗаполненияОбъектовБД
	|ГДЕ
	|	ПравилаЗаполненияОбъектовБД.Владелец = &ОбъектБД
	|	И НЕ ПравилаЗаполненияОбъектовБД.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ОбъектБД",ОбъектБД);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		НоваяСтрока=ТаблицаПравилЗаполнения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Результат);
		
		Если ЗначениеЗаполнено(Результат.ИсходныйОбъектБД) И Результат.ТипБД=Справочники.ТипыБазДанных.ТекущаяИБ Тогда
			
			НоваяСтрока.СпособФормирования=Перечисления.СпособыФормированияДокументовПоПравилам.Автоматически;
			
		Иначе
			
			НоваяСтрока.СпособФормирования=Перечисления.СпособыФормированияДокументовПоПравилам.Вручную;
			
		КонецЕсли;
				
		НоваяСтрока.ПроводитьДокументы=НоваяСтрока.СпособФормирования=Перечисления.СпособыФормированияДокументовПоПравилам.Автоматически;
		
		Если Результат.ТипБД=Справочники.ТипыБазДанных.ТекущаяИБ Тогда
			
			НоваяСтрока.ИспользуемаяИБ=Справочники.ВнешниеИнформационныеБазы.ТекущаяИБ;
			
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОбъектуБД(Команда)
	
	ЗаполнитьПоОбъектуБДНаСервере();
	Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравилНастройкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Элемент.ТекущийЭлемент.Имя="ТаблицаПравилНастройкиСпособФормирования" Тогда 
		
		ТекСписокВыбора = Элементы.ТаблицаПравилНастройкиСпособФормирования.СписокВыбора;
		ТекСписокВыбора.Очистить(); 
		
		СписокСпособов=ЗаполнитьСписокСпособовФормирования(Элементы.ТаблицаПравилНастройки.ТекущиеДанные.ПолучитьИдентификатор());
		
		Для Каждого Элемент ИЗ СписокСпособов Цикл
			
			ТекСписокВыбора.Добавить(Элемент.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
			
	
КонецПроцедуры
